# St7GetSolverNonlinearMaterial

Returns the state assigned for the Nonlinear Material option for nonlinear analyses.

long St7GetSolverNonlinearMaterial(long uID, bool* NonlinearMaterial)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
NonlinearMaterial
True if the Nonlinear Material option is enabled.